In [ ]:
from torchvision import models
dir(models)

In [ ]:
import itertools
dir(itertools)

In [ ]:
import itertools
import operator

numbers = [1, 2, 3, 4, 5]

prd = list(itertools.accumulate(numbers,operator.sub))
print(prd)
initial_balance = 1000
transactions = [50, -200, 120, -30, 75]

account_history = list(itertools.accumulate([initial_balance] + transactions))
account_history

In [ ]:
import operator
help(operator.countOf)

In [ ]:
import itertools

user_ids = [101, 102, 103, 104, 201, 202, 203, 204, 301]
api_limit = 3

batch = []
i=0
for id_batch in itertools.batched(user_ids, api_limit):
    print(f"Processing batch of user IDs: {id_batch}")
    batch.append(id_batch)
    i += 1
    # In a real application, you would make your API call here, e.g.:
    # api.fetch_user_data(id_batch)
batch

In [ ]:
import itertools

list1 = ['a', 'b', 'c']
list2 = [1, 2, 3]

# Chain the two lists together
chained_iterator = itertools.chain(list1, list2)

# Iterate over the result
for item in chained_iterator:
    print(item, end=' ')

In [ ]:
import itertools

list_of_lists = [[['a', 'b', 'c'], [1, 2, 3], ['X', 'Y', 'Z'],[4,5]],[6,7,9]]

# Chain the inner lists together
chained_iterator = itertools.chain.from_iterable(list_of_lists)

print(list(chained_iterator))

In [ ]:
def flatten(nested_list):
    """Recursively flattens a list with irregular nesting."""
    for item in nested_list:
        if isinstance(item, list):
            # If the item is a list, yield from the result of flattening it
            yield from flatten(item)
        else:
            # If the item is not a list, yield the item itself
            yield item

my_list = [[['a', 'b', 'c'], [1, 2, 3], ['X', 'Y', 'Z'], [4, 5]], [6, 7, 9],[4,2,1]]

# The function returns a generator, so we convert it to a list
flat_list = list(flatten(my_list))

print(flat_list)

In [ ]:
import numpy as np
dict_val = {'a':[5,2,1],'b':[4,8,1]}
#dict_val['c'] = [x+y for x,y in zip(dict_val['a'],dict_val['b'])]
dict_val['c'] = (np.array(dict_val['a']) + np.array(dict_val['b'])).tolist()
#dict_val['c'] = dict_val['c'].tolist()
dict_val

In [ ]:
x = 'fly'
isinstance(x,(float,int))
print(type(x))

In [ ]:
import numpy as np
a = np.array([5,2.2,4],dtype=np.int16)
print(a)
print(type(a[1]))

In [ ]:
print(5 == 5.00)
print(5 is 5.00)

In [ ]:
print(None is False)
print(0 == False)
print('val' == True)

In [ ]:
def flatten(lst):
    for item in lst:
        if isinstance(item,list):
            yield from flatten(item)
        else:
            yield item

a = [[3,5,6],[4,2,6],[1,9],5]
b = list(flatten(a))
print(a)
print(b)

In [ ]:
def factorial(num: int) -> int:
    if num == 1 or num == 0:
        return 1
    else:
        return num * factorial(num - 1)
print(factorial(8))

In [ ]:
import numpy as np
a = np.array([4,2,7])
b = np.array([1,7,3])
c = a + b
c

In [ ]:
e:list = [5,2,4,8]
f = [4,1,7]
e + f

In [ ]:
a:dict = {'a':[4,5,6]}
a.update({'b':[5,6]})
a

In [ ]:
def div_val(a: int, b: int):
    '''This is a function to get Quoient '''
    try:
        return a/b
    except ZeroDivisionError:
        print("The value of b cannot be 0")
r = div_val(0,0)
print(r)

In [ ]:
import math
#dir(math)

In [ ]:
with open('test2.txt','w') as f:
    lines_gen = (f'This is line {i}\n' for i in range(10_000))
    f.writelines(lines_gen)

In [ ]:
with open('test3.txt','w') as f:
    #lines_gen = (f'This is line {i}\n' for i in range(10_000))
    for i in range(10_000):
        f.write(f'{i}\n')

In [ ]:
original_dict = {'a': 1, 'b': 2, 'c': 3}
inverted_dict = {}

for key, value in original_dict.items():
    inverted_dict[value] = key

print(inverted_dict)

In [ ]:
from datetime import datetime
import time
with open('log.txt','w') as f:
    for i in range(0,10):
        print(datetime.now().strftime('%Y%m%d_%H:%M:%S - '),i)
        f.write(datetime.now().strftime('%Y%m%d_%H:%M:%S - '))
        time.sleep(1)
        f.write(str(i))
        f.write("\n")

In [ ]:
a = [5,6,73,1,8,32,54]
for num in a:
    print(num)

In [7]:
import pandas as pd
import numpy as np
pd.__version__

'2.3.2'

In [9]:
a = pd.Series([4,5,6],dtype=np.int16)
a.dtype

dtype('int16')

In [10]:
pd.Series(['apple','banana','orange'],name='fruit')

0     apple
1    banana
2    orange
Name: fruit, dtype: object

In [11]:
pd.DataFrame([[1,4],[2,7]],columns=['A','B'])

   A  B
0  1  4
1  2  7

In [25]:
a = {'A':[4,5,6],'B':[7,2,1]}
a.get('D','Does not Exist')

'Does not Exist'

In [26]:
dir(dict)

['__class__',
 '__class_getitem__',
 '__contains__',
 '__delattr__',
 '__delitem__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__ior__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__ne__',
 '__new__',
 '__or__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__reversed__',
 '__ror__',
 '__setattr__',
 '__setitem__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 'clear',
 'copy',
 'fromkeys',
 'get',
 'items',
 'keys',
 'pop',
 'popitem',
 'setdefault',
 'update',
 'values']

In [18]:
pd.Series([5,6,7,8],index=['Dog','Rat','Cat','Bat'])

Dog    5
Rat    6
Cat    7
Bat    8
dtype: int64

In [31]:
idx = pd.Index(['Dog','Cat','Human'],name='animal')
ser = pd.Series([4,4,2],index=idx,name='No of Legs')
ser.index.name

'animal'

In [42]:
idx = pd.Index(['Jack','Jill'],name='person')
df = pd.DataFrame([[24,180,'Blue'],[27,185,'Black']],index=idx,columns=['Age','Height','Eye_Color'])
df

        Age  Height Eye_Color
person
Jack     24     180      Blue
Jill     27     185     Black

In [59]:
t = [5,7,1,2,0,56,43,89]
r = t.copy()
print('r',r)
t.sort(reverse=True)
print("t",t)
print('r',r)

r [5, 7, 1, 2, 0, 56, 43, 89]
t [89, 56, 43, 7, 5, 2, 1, 0]
r [5, 7, 1, 2, 0, 56, 43, 89]

In [60]:
print('Address of r',id(r))
print('Address of t',id(t))

Address of r 4603948800
Address of t 4611537024

In [69]:
df2 = df.copy()
print('Address of df',id(df))
print('Address of df2',id(df2))
df2

Address of df 4606296768
Address of df2 4599162608

        Age  Height Eye_Color
person
Jack     24     180      Blue
Jill     27     185     Black

In [4]:
t1 = tuple()
t2 = tuple()
print('t1',id(t1))
print('t2',id(t2))

t1 4530261184
t2 4530261184

In [6]:
t2 = tuple([3,4,5])
print('t1:',t1)
print('t2:',t2)
print('t1',id(t1))
print('t2',id(t2))
print(type(t2))

t1: ()
t2: (3, 4, 5)
t1 4530261184
t2 4578579200
<class 'tuple'>

In [1]:
import pandas as pd
df = pd.DataFrame([[24,180,'blue'],[42,166,'brown'],[22,160,'green']],columns=['age','height','eye_color'])
df

   age  height eye_color
0   24     180      blue
1   42     166     brown
2   22     160     green

In [2]:
col_idx = df.columns.get_indexer(['height','age'])
col_idx

array([1, 0])

In [3]:
df.iloc[[0,2,1],col_idx]

   height  age
0     180   24
2     160   22
1     166   42

In [4]:
import timeit

def get_indexer_approach():
    col_idx = df.columns.get_indexer(['age','eye_color'])
    df.iloc[[0,1],col_idx]

timeit.timeit(get_indexer_approach,number=10_000)

7.485001913000005

In [5]:
two_step_app = lambda: df[['age','eye_color']].iloc[[0,1]]
timeit.timeit(two_step_app,number=10_000)

5.331864935999988

In [6]:
df.filter(like='_')

  eye_color
0      blue
1     brown
2     green

In [7]:
df_dtypes = pd.DataFrame([[0,1.0,'2'],[4,8.0,'16']],columns=['int_col','float_col','string_col'])
df_dtypes

   int_col  float_col string_col
0        0        1.0          2
1        4        8.0         16

In [8]:
df_dtypes.select_dtypes(include='object')

  string_col
0          2
1         16

In [9]:
df_dtypes.select_dtypes(exclude=['int','float'])

  string_col
0          2
1         16

In [10]:
from decimal import Decimal
f = float(9.01342)
d = Decimal(9.01342)
print('f:',f)
print('d:',d)

f: 9.01342
d: 9.013419999999999987494447850622236728668212890625

In [11]:
df_dtypes['dec_col'] = df_dtypes['string_col'].apply(Decimal)
df_dtypes

   int_col  float_col string_col dec_col
0        0        1.0          2       2
1        4        8.0         16      16

In [12]:
import numpy as np
df_mask = pd.DataFrame(np.arange(6).reshape(3,-1))
df_mask

   0  1
0  0  1
1  2  3
2  4  5

In [13]:
mask = [True,False,True]

In [14]:
idx = pd.MultiIndex.from_tuples([('John','Smith'),('John','Doe'),('Jane','Doe'),('Stephen','Smith')],names=['first','last'])
ser = pd.Series(range(4),index=idx)
ser

first    last
John     Smith    0
         Doe      1
Jane     Doe      2
Stephen  Smith    3
dtype: int64

In [19]:
flo_val = float(6.7832)
dec_val = Decimal(str(flo_val))
dec_val*2

Decimal('13.5664')

In [2]:
import pandas as pd
pd.Series(range(5),dtype=pd.Int8Dtype())

0    0
1    1
2    2
3    3
4    4
dtype: Int8

In [4]:
ser1 = pd.Series([1_00_000.123],dtype=pd.Float32Dtype())
ser2 = pd.Series([1_00_000.124],dtype=pd.Float32Dtype())
ser1 == ser2

0    True
dtype: boolean

In [5]:
ser1 = pd.Series([1_00_000.123],dtype=pd.Float64Dtype())
ser2 = pd.Series([1_00_000.124],dtype=pd.Float64Dtype())
ser1 == ser2

0    False
dtype: boolean

In [6]:
import numpy as np
np.nan == np.nan

False

In [7]:
pd.NA == pd.NA

In [11]:
ser = pd.Series(range(3),dtype=pd.Int64Dtype())
mask = pd.Series([True,pd.NA,False],dtype=pd.BooleanDtype())
ser[mask]

0    0
dtype: Int64

In [ ]:
values = ['foo','bar','baz']
val_ser = pd.Series(values,dtype=pd.CategoricalDtype())
val_ser

values = ['foo','bar','baz']
val_ser = pd.Series(values,dtype=pd.StringDtype())
val_ser

0    foo
1    bar
2    baz
dtype: category
Categories (3, object): ['bar', 'baz', 'foo']

In [20]:
df = pd.DataFrame({'animal':['cat','dog','cat','rat','bat','dog','rat'],'age':[2,6,1,5,4,7,9]})
print(df['animal'].dtype)
print(df['age'].dtype)
df['animal'] = df['animal'].astype(pd.CategoricalDtype())
print(df['animal'].dtype)
print(df['age'].dtype)
df

object
int64
category
int64

  animal  age
0    cat    2
1    dog    6
2    cat    1
3    rat    5
4    bat    4
5    dog    7
6    rat    9

In [22]:
shirt_sizes = pd.Series(['S','M','L','XL','XXL'],dtype=pd.StringDtype())
cat = pd.CategoricalDtype(shirt_sizes,ordered=True)
ser = pd.Series(['M','L','S','XL','M','XXL','S'],dtype=cat)
ser < 'L'

0     True
1    False
2     True
3    False
4     True
5    False
6     True
dtype: bool

In [24]:
accepted_val = pd.Series(['foo','bar'],dtype=pd.StringDtype())
cat = pd.CategoricalDtype(accepted_val)
print('str',pd.Series(['foo','bar','baz'] * 100,dtype=pd.StringDtype()).memory_usage())
print('cat',pd.Series(['foo','bar','baz'] * 100,dtype=cat).memory_usage())

str 2532
cat 556

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})

In [ ]:
df = pd.merge(person,address,how='left',on=['personId','personId'])
df

   personId firstName lastName  addressId           city     state
0         1      Wang    Allen       <NA>            NaN       NaN
1         2     Alice      Bob          1  New York City  New York